
"""
Реалізуйте алгоритм сортування вибором.
"""

N = 5000     # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for j in range(n, 1, -1):
        pos = 0
        for i in range(1, j):
            if array[i] > array[pos]:
                pos = i
        array[pos], array[j - 1] = array[j - 1], array[pos]
        # print(array)


if __name__ == '__main__':
    arr = [9, 1, -1, 20, 19, 10, -5, 13, 7]
    print(arr)
    sort(arr)
