
"""
Реалізуйте алгоритм сортування вставкою
"""

N = 10000    # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for i in range(1, n):
        pos = i
        x = array[pos]
        while pos > 0:
            if array[pos - 1] > x:
                array[pos] = array[pos - 1]
            else:
                break
            pos -= 1
        array[pos] = x
        # print(array)


if __name__ == "__main__":
    arr = [-1, 7, 1, 19, 0, 10, 23, 9, 17, -5]
    # arr = [0, 4, 6, 9, 10, 25, 5]

    print(arr)
    sort(arr)
    # print(arr)
