
"""
Реалізуйте алгоритм сортування вибором.
"""

N = 10000    # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)

    for j in range(n - 1):
        maxpos = 0
        for i in range(1, n - j):
            if array[maxpos] < array[i]:
                maxpos = i
        array[maxpos], array[i] = array[i], array[maxpos]
        # print(array, j)


if __name__ == "__main__":
    a = [56, 32, 2, 9, 0, 3, 5, 87, 53]
    print(a)
    sort(a)
    # print(a)


