
"""
Реалізуйте алгоритм сортування вставкою
"""

N = 10000    # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for i in range(1, n):
        pos = i
        cur = array[i]
        while pos > 0:
            if array[pos - 1] > cur:
                array[pos] = array[pos - 1]
            else:
                break
            pos -= 1

        array[pos] = cur


if __name__ == "__main__":
    a = [4, -3, 0, 1, 7, 9, 15, -10, 2, 23, 6, -4]
    # cur = -3
    # a = [4, 4, 0, 1, 7, 9, 15, -10, 2, 23, 6, -4]
    # a = [-3, 4, 0, 1, 7, 9, 15, -10, 2, 23, 6, -4]
    #
    # a = [-10, -3, 0, 1, -4, 7, 4, 9, 15, 2, 23, 6]
    # cur = -4
    # a = [-10, -3, 0, 1, 1, 7, 4, 9, 15, 2, 23, 6]
    # a = [-10, -3, 0, 0, 1, 7, 4, 9, 15, 2, 23, 6]
    # a = [-10, -3, -3, 0, 1, 7, 4, 9, 15, 2, 23, 6]
    # a = [-10, -4, -3, 0, 1, 7, 4, 9, 15, 2, 23, 6]

    sort(a)
