
"""
Реалізуйте алгоритм сортування вибором.
"""

N = 10000    # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for i in range(n, 1, -1):
        pos = 0
        for j in range(1, i):
            if array[j] > array[pos]:
                pos = j
        array[pos], array[i - 1] = array[i - 1], array[pos]
        # print(array)


if __name__ == '__main__':
    arr = [6, 10, -2, 4, -15, 15, 5, 1]
    print(arr)
    sort(arr)
    print(arr)
