
"""
Реалізуйте алгоритм сортування вставкою
"""

N = 10000    # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for i in range(n):
        item = array[i]
        while i > 0:
            if array[i - 1] > item:
                array[i] = array[i - 1]
            else:
                break
            i -= 1
        array[i] = item
