
"""
Реалізуйте алгоритм сортування обміном (бульбашкове сортування).
"""

N = 10000    # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for j in range(1, n):
        for i in range(n - j):
            if array[i] > array[i + 1]:
                array[i], array[i + 1] = array[i + 1], array[i]


if __name__ == "__main__":
    a = [4, -3, 0, 1, 7, 9, 15, 2, 23, 6, -4]
    sort(a)
