
"""
Модифікуйте алгоритм бульбашкового сортування,
перевіркою на кожному проході чи відсортований вже масив.
Порівняйте час виконання обох програм.
"""

N = 10000    # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for pass_num in range(n - 1, 1, -1):
        _sorted = True
        for i in range(pass_num):
            if array[i] > array[i + 1]:
                array[i], array[i + 1] = array[i + 1], array[i]
                _sorted = False
        if _sorted:
            return


if __name__ == "__main__":
    a = [56, 32, 2, 9, 0, 3, 5, 87, 53]
    print(a)
    sort(a)
    print(a)
