
"""
Реалізуйте алгоритм сортування вставкою
"""

N = 5000     # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for i in range(1, n):
        pos = i
        x = array[pos]
        while pos > 0:
            if array[pos - 1] > x:
                array[pos] = array[pos - 1]
            else:
                break
            pos -= 1
        array[pos] = x
        # print(array)


if __name__ == '__main__':
    arr = [9, 1, -1, 20, 19, 10, -5, 13, 7]
    # arr = [3, 6, 7, 10, 15, -5]
    print(arr)
    sort(arr)
